slides/lecture08.org
# How to make it work with Spacemacs
# 1. Add the following to .spacemacs file
# (org :variables
#      org-enable-github-support t
#      org-enable-reveal-js-support t)
# 2. Use M-x org-reveal-export-to-html-and-browse

#+TITLE: Canonical Structures & Hierarchies
#+DATE: 2021.04.29
#+AUTHOR: Anton Trunov
#+EMAIL: https://github.com/anton-trunov
#+OPTIONS: num:nil toc:nil timestamp:nil
#+REVEAL_TRANS: none
# none | fade | slide | convex | concave | zoom
#+REVEAL_THEME: beige
# default | beige | sky | night | serif | simple | moon
# /League/Sky/Beige/Simple/Serif/Blood/Night/Moon/Solarized
#+REVEAL_EXTRA_CSS: ./modifications.css

* Motivation
- Generic comparison operation
- ~x == y~
#+BEGIN_SRC coq
  eq_op : (T : Type) -> (x y : T) -> bool

  Notation "x == y" := (eq_op _ x y).
#+END_SRC
- =eq_op= is not possible to implement in general
* Solution: eqType structure
#+BEGIN_SRC coq
  Structure eqType := Pack {
    sort : Type;
    eq_op : sort -> sort -> bool;
    spec : forall x y,
             reflect (x = y) (eq_op x y)
  }.






#+END_SRC
* Solution: eqType structure
#+BEGIN_SRC coq
  Inductive eqType :=
   Pack : forall
           (sort : Type)
           (eq_op : sort -> sort -> bool)
           (spec : forall x y,
             reflect (x = y) (eq_op x y)),
           eqType.

  Definition sort (e : eqType) : Type :=
   let (sort, _, _) := e in sort.

  (* and `eq_op` and `spec` projections *)
#+END_SRC
* Solution: eqType structure
#+BEGIN_SRC coq
  Structure eqType := Pack {
   sort : Type;
   eq_op : sort -> sort -> bool;
   spec : forall x y, reflect (x = y) (eq_op x y)
  }.







#+END_SRC
* Solution: eqType structure
#+BEGIN_SRC coq
  Structure eqType := Pack {
   sort : Type;
   eq_op : sort -> sort -> bool;
   spec : forall x y, reflect (x = y) (eq_op x y)
  }.


  Coercion sort : eqType >-> Sortclass.




#+END_SRC
* Solution: eqType structure
#+BEGIN_SRC coq
  Structure eqType := Pack {
   sort : Type;
   eq_op : sort -> sort -> bool;
   spec : forall x y, reflect (x = y) (eq_op x y)
  }.


  Coercion sort : eqType >-> Sortclass.


  Lemma eq_sym (T : eqType) (x y : T) :
    x == y -> y == x.
#+END_SRC
* Solution: eqType structure
#+BEGIN_SRC coq
  Structure eqType := Pack {
   sort : Type;
   eq_op : sort -> sort -> bool;
   spec : forall x y, reflect (x = y) (eq_op x y)
  }.


  Coercion sort : eqType >-> Sortclass.


  Lemma eq_sym (T : eqType) (x y : sort T) :
    x == y -> y == x.
#+END_SRC
* Solution: eqType structure
#+BEGIN_SRC coq
  Structure eqType := Pack {
   sort : Type;
   eq_op : sort -> sort -> bool;
   spec : forall x y, reflect (x = y) (eq_op x y)
  }.
#+END_SRC
#+BEGIN_SRC coq
  eq_op : forall {T : eqType},
          sort T -> sort T -> bool
#+END_SRC
* Example: 1 == 2
initially we have
#+BEGIN_SRC coq
  1 == 2
#+END_SRC
* Example: 1 == 2
unfold ~==~ notation
#+BEGIN_SRC coq
  @eq_op _ 1 2        (* 1 == 2 *)
#+END_SRC
* Example: 1 == 2
unfold ~==~ notation
#+BEGIN_SRC coq
  eq_op _ 1 2
#+END_SRC
#+BEGIN_SRC coq
  @eq_op : forall (T : eqType),
          sort T -> sort T -> bool
#+END_SRC
* Example: 1 == 2
add types and names
#+BEGIN_SRC coq
  eq_op (?T : eqType) (1 : sort ?T) (2 : sort ?T)

#+END_SRC
* Example: 1 == 2
add types and names
#+BEGIN_SRC coq
  eq_op (?T : eqType) (1 : sort ?T) (2 : sort ?T)
  eq_op (?T : eqType) (1 : nat)     (2 : nat)
#+END_SRC
