slides/lecture08.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Canonical Structures &amp; Hierarchies</title>
<meta name="author" content="Anton Trunov"/>
<link rel="stylesheet" href="./reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="./reveal.js/css/theme/beige.css" id="theme"/>

<link rel="stylesheet" href="./modifications.css"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1 class="title">Canonical Structures &amp; Hierarchies</h1><h2 class="author">Anton Trunov</h2><h2 class="date">2021.04.29</h2>
</section>

<section>
<section id="slide-org235877e">
<h2 id="org235877e">Motivation</h2>
<ul>
<li>Generic comparison operation</li>
<li><code>x == y</code></li>

</ul>
<div class="org-src-container">

<pre class="src src-coq">eq_op : <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">T</span> : <span style="color: #ba2f59; font-weight: bold;">Type</span><span style="color: #3a81c3;">)</span> -&gt; <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">x y</span> : T<span style="color: #3a81c3;">)</span> -&gt; bool

<span style="color: #3a81c3; font-weight: bold;">Notation</span> <span style="color: #2d9574;">"x == y"</span> := <span style="color: #3a81c3;">(</span>eq_op _ x y<span style="color: #3a81c3;">)</span>.
</pre>
</div>
<ul>
<li><code>eq_op</code> is not possible to implement in general</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgc04958a">
<h2 id="orgc04958a">Solution: eqType structure</h2>
<div class="org-src-container">

<pre class="src src-coq"><span style="color: #3a81c3; font-weight: bold;">Structure</span> <span style="color: #6c3163; font-weight: bold;">eqType</span> := Pack <span style="color: #3a81c3;">{</span>
  <span style="color: #715ab1;">sort</span> : <span style="color: #ba2f59; font-weight: bold;">Type</span>;
  eq_op : sort -&gt; sort -&gt; bool;
  spec : <span style="color: #ba2f59; font-weight: bold;">forall</span> <span style="color: #715ab1;">x y</span>,
           reflect <span style="color: #6c3163;">(</span>x = y<span style="color: #6c3163;">)</span> <span style="color: #6c3163;">(</span>eq_op x y<span style="color: #6c3163;">)</span>
<span style="color: #3a81c3;">}</span>.






</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgfc60bc3">
<h2 id="orgfc60bc3">Solution: eqType structure</h2>
<div class="org-src-container">

<pre class="src src-coq"><span style="color: #3a81c3; font-weight: bold;">Inductive</span> <span style="color: #6c3163; font-weight: bold;">eqType</span> :=
 Pack : <span style="color: #ba2f59; font-weight: bold;">forall</span>
         <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">sort</span> : <span style="color: #ba2f59; font-weight: bold;">Type</span><span style="color: #3a81c3;">)</span>
         <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">eq_op</span> : sort -&gt; sort -&gt; bool<span style="color: #3a81c3;">)</span>
         <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">spec</span> : <span style="color: #ba2f59; font-weight: bold;">forall</span> <span style="color: #715ab1;">x y</span>,
           reflect <span style="color: #6c3163;">(</span>x = y<span style="color: #6c3163;">)</span> <span style="color: #6c3163;">(</span>eq_op x y<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>,
         eqType.

<span style="color: #3a81c3; font-weight: bold;">Definition</span> <span style="color: #6c3163; font-weight: bold;">sort</span> <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">e</span> : eqType<span style="color: #3a81c3;">)</span> : <span style="color: #ba2f59; font-weight: bold;">Type</span> :=
 <span style="color: #ba2f59; font-weight: bold;">let</span> <span style="color: #3a81c3;">(</span>sort, _, _<span style="color: #3a81c3;">)</span> := e <span style="color: #ba2f59; font-weight: bold;">in</span> sort.

<span style="color: #2aa1ae; background-color: #ecf3ec;">(* </span><span style="color: #2aa1ae; background-color: #ecf3ec;">and `eq_op` and `spec` projections </span><span style="color: #2aa1ae; background-color: #ecf3ec;">*)</span>
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgbdcdfc1">
<h2 id="orgbdcdfc1">Solution: eqType structure</h2>
<div class="org-src-container">

<pre class="src src-coq"><span style="color: #3a81c3; font-weight: bold;">Structure</span> <span style="color: #6c3163; font-weight: bold;">eqType</span> := Pack <span style="color: #3a81c3;">{</span>
 <span style="color: #715ab1;">sort</span> : <span style="color: #ba2f59; font-weight: bold;">Type</span>;
 eq_op : sort -&gt; sort -&gt; bool;
 spec : <span style="color: #ba2f59; font-weight: bold;">forall</span> <span style="color: #715ab1;">x y</span>, reflect <span style="color: #6c3163;">(</span>x = y<span style="color: #6c3163;">)</span> <span style="color: #6c3163;">(</span>eq_op x y<span style="color: #6c3163;">)</span>
<span style="color: #3a81c3;">}</span>.







</pre>
</div>
</section>
</section>
<section>
<section id="slide-orga18e053">
<h2 id="orga18e053">Solution: eqType structure</h2>
<div class="org-src-container">

<pre class="src src-coq"><span style="color: #3a81c3; font-weight: bold;">Structure</span> <span style="color: #6c3163; font-weight: bold;">eqType</span> := Pack <span style="color: #3a81c3;">{</span>
 <span style="color: #715ab1;">sort</span> : <span style="color: #ba2f59; font-weight: bold;">Type</span>;
 eq_op : sort -&gt; sort -&gt; bool;
 spec : <span style="color: #ba2f59; font-weight: bold;">forall</span> <span style="color: #715ab1;">x y</span>, reflect <span style="color: #6c3163;">(</span>x = y<span style="color: #6c3163;">)</span> <span style="color: #6c3163;">(</span>eq_op x y<span style="color: #6c3163;">)</span>
<span style="color: #3a81c3;">}</span>.


<span style="color: #3a81c3; font-weight: bold;">Coercion</span> <span style="color: #715ab1;">sort</span> : eqType &gt;-&gt; Sortclass.




</pre>
</div>
</section>
</section>
<section>
<section id="slide-org38747b2">
<h2 id="org38747b2">Solution: eqType structure</h2>
<div class="org-src-container">

<pre class="src src-coq"><span style="color: #3a81c3; font-weight: bold;">Structure</span> <span style="color: #6c3163; font-weight: bold;">eqType</span> := Pack <span style="color: #3a81c3;">{</span>
 <span style="color: #715ab1;">sort</span> : <span style="color: #ba2f59; font-weight: bold;">Type</span>;
 eq_op : sort -&gt; sort -&gt; bool;
 spec : <span style="color: #ba2f59; font-weight: bold;">forall</span> <span style="color: #715ab1;">x y</span>, reflect <span style="color: #6c3163;">(</span>x = y<span style="color: #6c3163;">)</span> <span style="color: #6c3163;">(</span>eq_op x y<span style="color: #6c3163;">)</span>
<span style="color: #3a81c3;">}</span>.


<span style="color: #3a81c3; font-weight: bold;">Coercion</span> <span style="color: #715ab1;">sort</span> : eqType &gt;-&gt; Sortclass.


<span style="color: #3a81c3; font-weight: bold;">Lemma</span> <span style="color: #6c3163; font-weight: bold;">eq_sym</span> <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">T</span> : eqType<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">x y</span> : T<span style="color: #3a81c3;">)</span> :
  x == y -&gt; y == x.
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org4500cf2">
<h2 id="org4500cf2">Solution: eqType structure</h2>
<div class="org-src-container">

<pre class="src src-coq"><span style="color: #3a81c3; font-weight: bold;">Structure</span> <span style="color: #6c3163; font-weight: bold;">eqType</span> := Pack <span style="color: #3a81c3;">{</span>
 <span style="color: #715ab1;">sort</span> : <span style="color: #ba2f59; font-weight: bold;">Type</span>;
 eq_op : sort -&gt; sort -&gt; bool;
 spec : <span style="color: #ba2f59; font-weight: bold;">forall</span> <span style="color: #715ab1;">x y</span>, reflect <span style="color: #6c3163;">(</span>x = y<span style="color: #6c3163;">)</span> <span style="color: #6c3163;">(</span>eq_op x y<span style="color: #6c3163;">)</span>
<span style="color: #3a81c3;">}</span>.


<span style="color: #3a81c3; font-weight: bold;">Coercion</span> <span style="color: #715ab1;">sort</span> : eqType &gt;-&gt; Sortclass.


<span style="color: #3a81c3; font-weight: bold;">Lemma</span> <span style="color: #6c3163; font-weight: bold;">eq_sym</span> <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">T</span> : eqType<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">x y</span> : sort T<span style="color: #3a81c3;">)</span> :
  x == y -&gt; y == x.
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orga0b7963">
<h2 id="orga0b7963">Solution: eqType structure</h2>
<div class="org-src-container">

<pre class="src src-coq"><span style="color: #3a81c3; font-weight: bold;">Structure</span> <span style="color: #6c3163; font-weight: bold;">eqType</span> := Pack <span style="color: #3a81c3;">{</span>
 <span style="color: #715ab1;">sort</span> : <span style="color: #ba2f59; font-weight: bold;">Type</span>;
 eq_op : sort -&gt; sort -&gt; bool;
 spec : <span style="color: #ba2f59; font-weight: bold;">forall</span> <span style="color: #715ab1;">x y</span>, reflect <span style="color: #6c3163;">(</span>x = y<span style="color: #6c3163;">)</span> <span style="color: #6c3163;">(</span>eq_op x y<span style="color: #6c3163;">)</span>
<span style="color: #3a81c3;">}</span>.
</pre>
</div>
<div class="org-src-container">

<pre class="src src-coq">eq_op : <span style="color: #ba2f59; font-weight: bold;">forall</span> <span style="color: #3a81c3;">{</span><span style="color: #715ab1;">T</span> : eqType<span style="color: #3a81c3;">}</span>,
        sort T -&gt; sort T -&gt; bool
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org6877b6c">
<h2 id="org6877b6c">Example: 1 == 2</h2>
<p>
initially we have
</p>
<div class="org-src-container">

<pre class="src src-coq"><span style="color: #4e3163;">1</span> == <span style="color: #4e3163;">2</span>
</pre>
</div>
</section>
</section>
