slides/lecture08.org
* Example: 1 == 2
so we need to be able to solve equations like
#+BEGIN_SRC coq
  sort (?T : eqType) ≡ nat
#+END_SRC
- inference is undecidable in this case
- we need hints for that
* Canonical Structures to the rescue
#+BEGIN_SRC coq
Canonical nat_eqType := Pack nat eqn proof.
Print Canonical Projections.
...
nat <- sort ( nat_eqType )
...
#+END_SRC
* Canonical Structures to the rescue
- Or you can print out just the instances for your projection
#+BEGIN_SRC coq
Print Canonical Projections sort.

nat <- sort ( nat_eqType )
#+END_SRC
* Example: 1 == 2
#+BEGIN_SRC coq


  eq_op (?T : eqType) (1 : sort ?T) (2 : sort ?T)
  eq_op (?T : eqType) (1 : nat)     (2 : nat)



#+END_SRC
* Example: 1 == 2
#+BEGIN_SRC coq
  nat <- sort ( nat_eqType )
    
  eq_op (?T : eqType) (1 : sort ?T) (2 : sort ?T)
                           |             |
                           v             v
  eq_op (?T : eqType) (1 : nat)     (2 : nat)
#+END_SRC
* Example: 1 == 2
#+BEGIN_SRC coq
  nat <- sort ( nat_eqType )
    
  eq_op (nat_eqType : eqType)
        (1 : sort nat_eqType)
        (2 : sort nat_eqType)
#+END_SRC
* Equality for product type
#+BEGIN_SRC coq
Definition pair_eq (A B : eqType)
                   (u v : A * B)
:= (u.1 == v.1) && (u.2 == v.2).








#+END_SRC
* Equality for product type
#+BEGIN_SRC coq
Definition pair_eq (A B : eqType)
                   (u v : A * B)
:= (u.1 == v.1) && (u.2 == v.2).

Canonical prod_eqType A B :=
  Pack (A * B) pair_eq proof.





#+END_SRC
* Equality for product type
#+BEGIN_SRC coq
Definition pair_eq (A B : eqType)
                   (u v : sort A * sort B)
:= (u.1 == v.1) && (u.2 == v.2).

Canonical prod_eqType A B :=
  Pack (sort A * sort B) pair_eq proof.





#+END_SRC
* Equality for product type
#+BEGIN_SRC coq
Definition pair_eq (A B : eqType)
                   (u v : sort A * sort B)
:= (u.1 == v.1) && (u.2 == v.2).

Canonical prod_eqType A B :=
  Pack (sort A * sort B) pair_eq proof.

Print Canonical Projections sort.
nat <- sort ( nat_eqType )
prod <- sort ( prod_eqType ) 
             
#+END_SRC
* Equality for product type
#+BEGIN_SRC coq
Definition pair_eq (A B : eqType)
                   (u v:prod (sort A) (sort B))
:= (u.1 == v.1) && (u.2 == v.2).

Canonical prod_eqType A B :=
  Pack (prod (sort A) (sort B)) pair_eq proof.

Print Canonical Projections sort.
nat <- sort ( nat_eqType )
prod <- sort ( prod_eqType ) 
             
#+END_SRC
