slides/lecture08.html
<section>
<section id="slide-org2e53de7">
<h2 id="org2e53de7">Example: 1 == 2</h2>
<p>
unfold <code>==</code> notation
</p>
<div class="org-src-container">

<pre class="src src-coq"><span style="color: #4e3163;">@</span>eq_op _ <span style="color: #4e3163;">1</span> <span style="color: #4e3163;">2</span>        <span style="color: #2aa1ae; background-color: #ecf3ec;">(* </span><span style="color: #2aa1ae; background-color: #ecf3ec;">1 == 2 </span><span style="color: #2aa1ae; background-color: #ecf3ec;">*)</span>
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgc892da3">
<h2 id="orgc892da3">Example: 1 == 2</h2>
<p>
unfold <code>==</code> notation
</p>
<div class="org-src-container">

<pre class="src src-coq">eq_op _ <span style="color: #4e3163;">1</span> <span style="color: #4e3163;">2</span>
</pre>
</div>
<div class="org-src-container">

<pre class="src src-coq"><span style="color: #4e3163;">@</span>eq_op : <span style="color: #ba2f59; font-weight: bold;">forall</span> <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">T</span> : eqType<span style="color: #3a81c3;">)</span>,
        sort T -&gt; sort T -&gt; bool
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgabceb3b">
<h2 id="orgabceb3b">Example: 1 == 2</h2>
<p>
add types and names
</p>
<div class="org-src-container">

<pre class="src src-coq">eq_op <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">?T</span> : eqType<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span> : sort <span style="color: #715ab1;">?T</span><span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">2</span> : sort <span style="color: #715ab1;">?T</span><span style="color: #3a81c3;">)</span>

</pre>
</div>
</section>
</section>
<section>
<section id="slide-org4c52fb1">
<h2 id="org4c52fb1">Example: 1 == 2</h2>
<p>
add types and names
</p>
<div class="org-src-container">

<pre class="src src-coq">eq_op <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">?T</span> : eqType<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span> : sort <span style="color: #715ab1;">?T</span><span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">2</span> : sort <span style="color: #715ab1;">?T</span><span style="color: #3a81c3;">)</span>
eq_op <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">?T</span> : eqType<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span> : nat<span style="color: #3a81c3;">)</span>     <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">2</span> : nat<span style="color: #3a81c3;">)</span>
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org84e2ef8">
<h2 id="org84e2ef8">Example: 1 == 2</h2>
<p>
so we need to be able to solve equations like
</p>
<div class="org-src-container">

<pre class="src src-coq">sort <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">?T</span> : eqType<span style="color: #3a81c3;">)</span> &#8801; nat
</pre>
</div>
<ul>
<li>inference is undecidable in this case</li>
<li>we need hints for that</li>

</ul>
</section>
</section>
<section>
<section id="slide-org20e9511">
<h2 id="org20e9511">Canonical Structures to the rescue</h2>
<div class="org-src-container">

<pre class="src src-coq">Canonical nat_eqType := Pack nat eqn proof.
<span style="color: #3a81c3; font-weight: bold;">Print</span> Canonical Projections.
...
nat &lt;- sort <span style="color: #3a81c3;">(</span> nat_eqType <span style="color: #3a81c3;">)</span>
...
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgc0858ea">
<h2 id="orgc0858ea">Canonical Structures to the rescue</h2>
<ul>
<li>Or you can print out just the instances for your projection</li>

</ul>
<div class="org-src-container">

<pre class="src src-coq"><span style="color: #3a81c3; font-weight: bold;">Print</span> Canonical Projections sort.

nat &lt;- sort <span style="color: #3a81c3;">(</span> nat_eqType <span style="color: #3a81c3;">)</span>
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgefe0494">
<h2 id="orgefe0494">Example: 1 == 2</h2>
<div class="org-src-container">

<pre class="src src-coq">

eq_op <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">?T</span> : eqType<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span> : sort <span style="color: #715ab1;">?T</span><span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">2</span> : sort <span style="color: #715ab1;">?T</span><span style="color: #3a81c3;">)</span>
eq_op <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">?T</span> : eqType<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span> : nat<span style="color: #3a81c3;">)</span>     <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">2</span> : nat<span style="color: #3a81c3;">)</span>



</pre>
</div>
</section>
</section>
<section>
<section id="slide-org1046cba">
<h2 id="org1046cba">Example: 1 == 2</h2>
<div class="org-src-container">

<pre class="src src-coq">nat &lt;- sort <span style="color: #3a81c3;">(</span> nat_eqType <span style="color: #3a81c3;">)</span>

eq_op <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">?T</span> : eqType<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span> : sort <span style="color: #715ab1;">?T</span><span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">2</span> : sort <span style="color: #715ab1;">?T</span><span style="color: #3a81c3;">)</span>
                         |             |
                         v             v
eq_op <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">?T</span> : eqType<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span> : nat<span style="color: #3a81c3;">)</span>     <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">2</span> : nat<span style="color: #3a81c3;">)</span>
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org1abe48c">
<h2 id="org1abe48c">Example: 1 == 2</h2>
<div class="org-src-container">

<pre class="src src-coq">nat &lt;- sort <span style="color: #3a81c3;">(</span> nat_eqType <span style="color: #3a81c3;">)</span>

eq_op <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">nat_eqType</span> : eqType<span style="color: #3a81c3;">)</span>
      <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span> : sort nat_eqType<span style="color: #3a81c3;">)</span>
      <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">2</span> : sort nat_eqType<span style="color: #3a81c3;">)</span>
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org002e96e">
<h2 id="org002e96e">Equality for product type</h2>
<div class="org-src-container">

<pre class="src src-coq"><span style="color: #3a81c3; font-weight: bold;">Definition</span> <span style="color: #6c3163; font-weight: bold;">pair_eq</span> <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">A B</span> : eqType<span style="color: #3a81c3;">)</span>
                   <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">u v</span> : A * B<span style="color: #3a81c3;">)</span>
:= <span style="color: #3a81c3;">(</span>u.<span style="color: #4e3163;">1</span> == v.<span style="color: #4e3163;">1</span><span style="color: #3a81c3;">)</span> &amp;&amp; <span style="color: #3a81c3;">(</span>u.<span style="color: #4e3163;">2</span> == v.<span style="color: #4e3163;">2</span><span style="color: #3a81c3;">)</span>.








</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgfd91884">
<h2 id="orgfd91884">Equality for product type</h2>
<div class="org-src-container">

<pre class="src src-coq"><span style="color: #3a81c3; font-weight: bold;">Definition</span> <span style="color: #6c3163; font-weight: bold;">pair_eq</span> <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">A B</span> : eqType<span style="color: #3a81c3;">)</span>
                   <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">u v</span> : A * B<span style="color: #3a81c3;">)</span>
:= <span style="color: #3a81c3;">(</span>u.<span style="color: #4e3163;">1</span> == v.<span style="color: #4e3163;">1</span><span style="color: #3a81c3;">)</span> &amp;&amp; <span style="color: #3a81c3;">(</span>u.<span style="color: #4e3163;">2</span> == v.<span style="color: #4e3163;">2</span><span style="color: #3a81c3;">)</span>.

Canonical prod_eqType A B :=
  Pack <span style="color: #3a81c3;">(</span>A * B<span style="color: #3a81c3;">)</span> pair_eq proof.





</pre>
</div>
</section>
</section>
<section>
<section id="slide-orge9e5b1f">
<h2 id="orge9e5b1f">Equality for product type</h2>
<div class="org-src-container">

<pre class="src src-coq"><span style="color: #3a81c3; font-weight: bold;">Definition</span> <span style="color: #6c3163; font-weight: bold;">pair_eq</span> <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">A B</span> : eqType<span style="color: #3a81c3;">)</span>
                   <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">u v</span> : sort A * sort B<span style="color: #3a81c3;">)</span>
:= <span style="color: #3a81c3;">(</span>u.<span style="color: #4e3163;">1</span> == v.<span style="color: #4e3163;">1</span><span style="color: #3a81c3;">)</span> &amp;&amp; <span style="color: #3a81c3;">(</span>u.<span style="color: #4e3163;">2</span> == v.<span style="color: #4e3163;">2</span><span style="color: #3a81c3;">)</span>.

Canonical prod_eqType A B :=
  Pack <span style="color: #3a81c3;">(</span>sort A * sort B<span style="color: #3a81c3;">)</span> pair_eq proof.





</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgbb5e1f2">
<h2 id="orgbb5e1f2">Equality for product type</h2>
<div class="org-src-container">

<pre class="src src-coq"><span style="color: #3a81c3; font-weight: bold;">Definition</span> <span style="color: #6c3163; font-weight: bold;">pair_eq</span> <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">A B</span> : eqType<span style="color: #3a81c3;">)</span>
                   <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">u v</span> : sort A * sort B<span style="color: #3a81c3;">)</span>
:= <span style="color: #3a81c3;">(</span>u.<span style="color: #4e3163;">1</span> == v.<span style="color: #4e3163;">1</span><span style="color: #3a81c3;">)</span> &amp;&amp; <span style="color: #3a81c3;">(</span>u.<span style="color: #4e3163;">2</span> == v.<span style="color: #4e3163;">2</span><span style="color: #3a81c3;">)</span>.

Canonical prod_eqType A B :=
  Pack <span style="color: #3a81c3;">(</span>sort A * sort B<span style="color: #3a81c3;">)</span> pair_eq proof.

<span style="color: #3a81c3; font-weight: bold;">Print</span> Canonical Projections sort.
nat &lt;- sort <span style="color: #3a81c3;">(</span> nat_eqType <span style="color: #3a81c3;">)</span>
prod &lt;- sort <span style="color: #3a81c3;">(</span> prod_eqType <span style="color: #3a81c3;">)</span> 

</pre>
</div>
</section>
</section>
<section>
<section id="slide-org9a1703d">
<h2 id="org9a1703d">Equality for product type</h2>
<div class="org-src-container">

<pre class="src src-coq"><span style="color: #3a81c3; font-weight: bold;">Definition</span> <span style="color: #6c3163; font-weight: bold;">pair_eq</span> <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">A B</span> : eqType<span style="color: #3a81c3;">)</span>
                   <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">u v</span>:prod <span style="color: #6c3163;">(</span>sort A<span style="color: #6c3163;">)</span> <span style="color: #6c3163;">(</span>sort B<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
:= <span style="color: #3a81c3;">(</span>u.<span style="color: #4e3163;">1</span> == v.<span style="color: #4e3163;">1</span><span style="color: #3a81c3;">)</span> &amp;&amp; <span style="color: #3a81c3;">(</span>u.<span style="color: #4e3163;">2</span> == v.<span style="color: #4e3163;">2</span><span style="color: #3a81c3;">)</span>.

Canonical prod_eqType A B :=
  Pack <span style="color: #3a81c3;">(</span>prod <span style="color: #6c3163;">(</span>sort A<span style="color: #6c3163;">)</span> <span style="color: #6c3163;">(</span>sort B<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span> pair_eq proof.

<span style="color: #3a81c3; font-weight: bold;">Print</span> Canonical Projections sort.
nat &lt;- sort <span style="color: #3a81c3;">(</span> nat_eqType <span style="color: #3a81c3;">)</span>
prod &lt;- sort <span style="color: #3a81c3;">(</span> prod_eqType <span style="color: #3a81c3;">)</span> 

</pre>
</div>
</section>
</section>
