slides/lecture08.org
* Example
#+BEGIN_SRC coq
Canonical bool_eqType := Pack bool eqb proof.
#+END_SRC

#+BEGIN_SRC coq
Compute (1, true) == (1, true).

#+END_SRC
* Example
#+BEGIN_SRC coq
Compute (1, true) == (1, true).
true
#+END_SRC
* How does it work?
#+BEGIN_SRC coq
(1, true) == (1, true)
#+END_SRC
* How does it work?
desugars into
#+BEGIN_SRC coq
eq_op _ (1, true) (1, true) 
#+END_SRC
* How does it work?
#+BEGIN_SRC coq
eq_op : (?T : eqType) -> (x y:sort ?T) -> bool
eq_op   _                (1, true)  ...








#+END_SRC
* How does it work?
#+BEGIN_SRC coq
eq_op : (?T : eqType) -> (x y:sort ?T) -> bool
eq_op   _                (1, true)  ...
                            ..
                         nat * bool






#+END_SRC
* How does it work?
#+BEGIN_SRC coq
eq_op : (?T : eqType) -> (x y:sort ?T) -> bool
eq_op   _                (1, true)  ...
                            ..
                         nat * bool
sort ?T ≡ nat * bool





#+END_SRC
* How does it work?
#+BEGIN_SRC coq
eq_op : (?T : eqType) -> (x y:sort ?T) -> bool
eq_op   _                (1, true)  ...
                            ..
                       prod nat bool
sort ?T ≡ prod nat bool





#+END_SRC
* How does it work?
#+BEGIN_SRC coq
eq_op : (?T : eqType) -> (x y:sort ?T) -> bool
eq_op   _                (1, true)  ...
                            ..
                       prod nat bool
sort ?T ≡ prod nat bool
prod <- sort ( prod_eqType ) 




#+END_SRC
* How does it work?
#+BEGIN_SRC coq
eq_op : (?T : eqType) -> (x y:sort ?T) -> bool
eq_op   _                (1, true)  ...
                            ..
                       prod nat bool
sort ?T ≡ prod nat bool
prod <- sort ( prod_eqType ) 
sort (prod_eqType ?A ?B) ≡ prod nat bool



#+END_SRC
* How does it work?
#+BEGIN_SRC coq
eq_op : (?T : eqType) -> (x y:sort ?T) -> bool
eq_op   _                (1, true)  ...
                            ..
                       prod nat bool
sort ?T ≡ prod nat bool
prod <- sort ( prod_eqType ) 
sort (prod_eqType ?A ?B) ≡ prod nat bool
(sort ?A) * (sort ?B) ≡ prod nat bool


#+END_SRC
* How does it work?
#+BEGIN_SRC coq
eq_op : (?T : eqType) -> (x y:sort ?T) -> bool
eq_op   _                (1, true)  ...
                            ..
                       prod nat bool
sort ?T ≡ prod nat bool
prod <- sort ( prod_eqType ) 
sort (prod_eqType ?A ?B) ≡ prod nat bool
prod (sort ?A) (sort ?B) ≡ prod nat bool


#+END_SRC
* How does it work?
#+BEGIN_SRC coq
eq_op : (?T : eqType) -> (x y:sort ?T) -> bool
eq_op   _                (1, true)  ...
                            ..
                       prod nat bool
sort ?T ≡ prod nat bool
prod <- sort ( prod_eqType ) 
sort (prod_eqType ?A ?B) ≡ prod nat bool
prod (sort ?A) (sort ?B) ≡ prod nat bool
(sort ?A) ≡ nat         (sort ?B) ≡ bool

#+END_SRC
