slides/lecture08.html
<section>
<section id="slide-orgf229e14">
<h2 id="orgf229e14">Example</h2>
<div class="org-src-container">

<pre class="src src-coq">Canonical bool_eqType := Pack bool eqb proof.
</pre>
</div>

<div class="org-src-container">

<pre class="src src-coq"><span style="color: #3a81c3; font-weight: bold;">Compute</span> <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span>, true<span style="color: #3a81c3;">)</span> == <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span>, true<span style="color: #3a81c3;">)</span>.

</pre>
</div>
</section>
</section>
<section>
<section id="slide-org9d5f808">
<h2 id="org9d5f808">Example</h2>
<div class="org-src-container">

<pre class="src src-coq"><span style="color: #3a81c3; font-weight: bold;">Compute</span> <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span>, true<span style="color: #3a81c3;">)</span> == <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span>, true<span style="color: #3a81c3;">)</span>.
true
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org5e835c0">
<h2 id="org5e835c0">How does it work?</h2>
<div class="org-src-container">

<pre class="src src-coq"><span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span>, true<span style="color: #3a81c3;">)</span> == <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span>, true<span style="color: #3a81c3;">)</span>
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org43bf4a4">
<h2 id="org43bf4a4">How does it work?</h2>
<p>
desugars into
</p>
<div class="org-src-container">

<pre class="src src-coq">eq_op _ <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span>, true<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span>, true<span style="color: #3a81c3;">)</span> 
</pre>
</div>
</section>
</section>
