slides/lecture08.org
* How does it work?
#+BEGIN_SRC coq
eq_op : (?T : eqType) -> (x y:sort ?T) -> bool
eq_op   _                (1, true)  ...
                            ..
                       prod nat bool
sort ?T ≡ prod nat bool
prod <- sort ( prod_eqType ) 
sort (prod_eqType ?A ?B) ≡ prod nat bool
prod (sort ?A) (sort ?B) ≡ prod nat bool
(sort ?A) ≡ nat         (sort ?B) ≡ bool
?A ≡ nat_eqType         ?B ≡ bool_eqType
#+END_SRC
* Canonical Structures vs Typeclasses
- Canonical Structures (CS) are /coherent/: one instance per key
- Typeclasses (TC) are not coherent: there may be several instances for a given type (with priorities)
* Canonical Structures vs Typeclasses
- CS work at the unification level (predictable)
- TC mechanism uses =eauto=-like proof search and may even loop forever
* Canonical Structures vs Typeclasses
- TC are keyed on types
- CS are _not_ tied to types and can be keyed on terms!
* Canonical Structures vs Typeclasses
- Both CS and TC can be used to implement overloading, implicit program (and proof) construction
- Performance issues: experimental rewriting of MathComp with type classes did not scale up to modules on a ring
* Keying on terms: big operations
Mathcomp's =bigop= module defines monoids like so:
#+BEGIN_SRC coq
Module Monoid.
...
Structure law (T : Type) (idm : T) : Type :=
 Law
  { operator : T -> T -> T;
    _ : associative operator;
    _ : left_id idm operator;
    _ : right_id idm operator }.
...
End Monoid.
#+END_SRC
* Keying on terms: big operations
- Monoids are usually not unique for a given type
Here are some instances on =nat=:
#+BEGIN_SRC coq
Canonical addn_monoid := Law addnA add0n addn0.
Canonical muln_monoid := Law mulnA mul1n muln1.
Canonical maxn_monoid := Law maxnA max0n maxn0.
#+END_SRC
- Haskell works around this using =newtype=
- Coq does not have to: it uses terms as keys
