slides/lecture08.html
<section>
<section id="slide-orga8865ee">
<h2 id="orga8865ee">How does it work?</h2>
<div class="org-src-container">

<pre class="src src-coq">eq_op : <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">?T</span> : eqType<span style="color: #3a81c3;">)</span> -&gt; <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">x y</span>:sort <span style="color: #715ab1;">?T</span><span style="color: #3a81c3;">)</span> -&gt; bool
eq_op   _                <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span>, true<span style="color: #3a81c3;">)</span>  ...








</pre>
</div>
</section>
</section>
<section>
<section id="slide-org5cdcfde">
<h2 id="org5cdcfde">How does it work?</h2>
<div class="org-src-container">

<pre class="src src-coq">eq_op : <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">?T</span> : eqType<span style="color: #3a81c3;">)</span> -&gt; <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">x y</span>:sort <span style="color: #715ab1;">?T</span><span style="color: #3a81c3;">)</span> -&gt; bool
eq_op   _                <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span>, true<span style="color: #3a81c3;">)</span>  ...
                            ..
                         nat * bool






</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgf3b2bfc">
<h2 id="orgf3b2bfc">How does it work?</h2>
<div class="org-src-container">

<pre class="src src-coq">eq_op : <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">?T</span> : eqType<span style="color: #3a81c3;">)</span> -&gt; <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">x y</span>:sort <span style="color: #715ab1;">?T</span><span style="color: #3a81c3;">)</span> -&gt; bool
eq_op   _                <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span>, true<span style="color: #3a81c3;">)</span>  ...
                            ..
                         nat * bool
sort <span style="color: #715ab1;">?T</span> &#8801; nat * bool





</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgf3ecc7f">
<h2 id="orgf3ecc7f">How does it work?</h2>
<div class="org-src-container">

<pre class="src src-coq">eq_op : <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">?T</span> : eqType<span style="color: #3a81c3;">)</span> -&gt; <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">x y</span>:sort <span style="color: #715ab1;">?T</span><span style="color: #3a81c3;">)</span> -&gt; bool
eq_op   _                <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span>, true<span style="color: #3a81c3;">)</span>  ...
                            ..
                       prod nat bool
sort <span style="color: #715ab1;">?T</span> &#8801; prod nat bool





</pre>
</div>
</section>
</section>
<section>
<section id="slide-org6d5de36">
<h2 id="org6d5de36">How does it work?</h2>
<div class="org-src-container">

<pre class="src src-coq">eq_op : <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">?T</span> : eqType<span style="color: #3a81c3;">)</span> -&gt; <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">x y</span>:sort <span style="color: #715ab1;">?T</span><span style="color: #3a81c3;">)</span> -&gt; bool
eq_op   _                <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span>, true<span style="color: #3a81c3;">)</span>  ...
                            ..
                       prod nat bool
sort <span style="color: #715ab1;">?T</span> &#8801; prod nat bool
prod &lt;- sort <span style="color: #3a81c3;">(</span> prod_eqType <span style="color: #3a81c3;">)</span> 




</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgce55782">
<h2 id="orgce55782">How does it work?</h2>
<div class="org-src-container">

<pre class="src src-coq">eq_op : <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">?T</span> : eqType<span style="color: #3a81c3;">)</span> -&gt; <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">x y</span>:sort <span style="color: #715ab1;">?T</span><span style="color: #3a81c3;">)</span> -&gt; bool
eq_op   _                <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span>, true<span style="color: #3a81c3;">)</span>  ...
                            ..
                       prod nat bool
sort <span style="color: #715ab1;">?T</span> &#8801; prod nat bool
prod &lt;- sort <span style="color: #3a81c3;">(</span> prod_eqType <span style="color: #3a81c3;">)</span> 
sort <span style="color: #3a81c3;">(</span>prod_eqType <span style="color: #715ab1;">?A</span> <span style="color: #715ab1;">?B</span><span style="color: #3a81c3;">)</span> &#8801; prod nat bool



</pre>
</div>
</section>
</section>
<section>
<section id="slide-org4de8d5a">
<h2 id="org4de8d5a">How does it work?</h2>
<div class="org-src-container">

<pre class="src src-coq">eq_op : <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">?T</span> : eqType<span style="color: #3a81c3;">)</span> -&gt; <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">x y</span>:sort <span style="color: #715ab1;">?T</span><span style="color: #3a81c3;">)</span> -&gt; bool
eq_op   _                <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span>, true<span style="color: #3a81c3;">)</span>  ...
                            ..
                       prod nat bool
sort <span style="color: #715ab1;">?T</span> &#8801; prod nat bool
prod &lt;- sort <span style="color: #3a81c3;">(</span> prod_eqType <span style="color: #3a81c3;">)</span> 
sort <span style="color: #3a81c3;">(</span>prod_eqType <span style="color: #715ab1;">?A</span> <span style="color: #715ab1;">?B</span><span style="color: #3a81c3;">)</span> &#8801; prod nat bool
<span style="color: #3a81c3;">(</span>sort <span style="color: #715ab1;">?A</span><span style="color: #3a81c3;">)</span> * <span style="color: #3a81c3;">(</span>sort <span style="color: #715ab1;">?B</span><span style="color: #3a81c3;">)</span> &#8801; prod nat bool


</pre>
</div>
</section>
</section>
<section>
<section id="slide-org83c453d">
<h2 id="org83c453d">How does it work?</h2>
<div class="org-src-container">

<pre class="src src-coq">eq_op : <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">?T</span> : eqType<span style="color: #3a81c3;">)</span> -&gt; <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">x y</span>:sort <span style="color: #715ab1;">?T</span><span style="color: #3a81c3;">)</span> -&gt; bool
eq_op   _                <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span>, true<span style="color: #3a81c3;">)</span>  ...
                            ..
                       prod nat bool
sort <span style="color: #715ab1;">?T</span> &#8801; prod nat bool
prod &lt;- sort <span style="color: #3a81c3;">(</span> prod_eqType <span style="color: #3a81c3;">)</span> 
sort <span style="color: #3a81c3;">(</span>prod_eqType <span style="color: #715ab1;">?A</span> <span style="color: #715ab1;">?B</span><span style="color: #3a81c3;">)</span> &#8801; prod nat bool
prod <span style="color: #3a81c3;">(</span>sort <span style="color: #715ab1;">?A</span><span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span>sort <span style="color: #715ab1;">?B</span><span style="color: #3a81c3;">)</span> &#8801; prod nat bool


</pre>
</div>
</section>
</section>
<section>
<section id="slide-org71922ee">
<h2 id="org71922ee">How does it work?</h2>
<div class="org-src-container">

<pre class="src src-coq">eq_op : <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">?T</span> : eqType<span style="color: #3a81c3;">)</span> -&gt; <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">x y</span>:sort <span style="color: #715ab1;">?T</span><span style="color: #3a81c3;">)</span> -&gt; bool
eq_op   _                <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span>, true<span style="color: #3a81c3;">)</span>  ...
                            ..
                       prod nat bool
sort <span style="color: #715ab1;">?T</span> &#8801; prod nat bool
prod &lt;- sort <span style="color: #3a81c3;">(</span> prod_eqType <span style="color: #3a81c3;">)</span> 
sort <span style="color: #3a81c3;">(</span>prod_eqType <span style="color: #715ab1;">?A</span> <span style="color: #715ab1;">?B</span><span style="color: #3a81c3;">)</span> &#8801; prod nat bool
prod <span style="color: #3a81c3;">(</span>sort <span style="color: #715ab1;">?A</span><span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span>sort <span style="color: #715ab1;">?B</span><span style="color: #3a81c3;">)</span> &#8801; prod nat bool
<span style="color: #3a81c3;">(</span>sort <span style="color: #715ab1;">?A</span><span style="color: #3a81c3;">)</span> &#8801; nat         <span style="color: #3a81c3;">(</span>sort <span style="color: #715ab1;">?B</span><span style="color: #3a81c3;">)</span> &#8801; bool

</pre>
</div>
</section>
</section>
<section>
<section id="slide-org24b2763">
<h2 id="org24b2763">How does it work?</h2>
<div class="org-src-container">

<pre class="src src-coq">eq_op : <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">?T</span> : eqType<span style="color: #3a81c3;">)</span> -&gt; <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">x y</span>:sort <span style="color: #715ab1;">?T</span><span style="color: #3a81c3;">)</span> -&gt; bool
eq_op   _                <span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span>, true<span style="color: #3a81c3;">)</span>  ...
                            ..
                       prod nat bool
sort <span style="color: #715ab1;">?T</span> &#8801; prod nat bool
prod &lt;- sort <span style="color: #3a81c3;">(</span> prod_eqType <span style="color: #3a81c3;">)</span> 
sort <span style="color: #3a81c3;">(</span>prod_eqType <span style="color: #715ab1;">?A</span> <span style="color: #715ab1;">?B</span><span style="color: #3a81c3;">)</span> &#8801; prod nat bool
prod <span style="color: #3a81c3;">(</span>sort <span style="color: #715ab1;">?A</span><span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span>sort <span style="color: #715ab1;">?B</span><span style="color: #3a81c3;">)</span> &#8801; prod nat bool
<span style="color: #3a81c3;">(</span>sort <span style="color: #715ab1;">?A</span><span style="color: #3a81c3;">)</span> &#8801; nat         <span style="color: #3a81c3;">(</span>sort <span style="color: #715ab1;">?B</span><span style="color: #3a81c3;">)</span> &#8801; bool
<span style="color: #715ab1;">?A</span> &#8801; nat_eqType         <span style="color: #715ab1;">?B</span> &#8801; bool_eqType
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgb8d7168">
<h2 id="orgb8d7168">Canonical Structures vs Typeclasses</h2>
<ul>
<li>Canonical Structures (CS) are <i>coherent</i>: one instance per key</li>
<li>Typeclasses (TC) are not coherent: there may be several instances for a given type (with priorities)</li>

</ul>
</section>
</section>
<section>
<section id="slide-org6f8d9e2">
<h2 id="org6f8d9e2">Canonical Structures vs Typeclasses</h2>
<ul>
<li>CS work at the unification level (predictable)</li>
<li>TC mechanism uses <code>eauto</code>-like proof search and may even loop forever</li>

</ul>
</section>
</section>
<section>
<section id="slide-org8cf6484">
<h2 id="org8cf6484">Canonical Structures vs Typeclasses</h2>
<ul>
<li>TC are keyed on types</li>
<li>CS are <span class="underline">not</span> tied to types and can be keyed on terms!</li>

</ul>
</section>
</section>
<section>
<section id="slide-org2a7720e">
<h2 id="org2a7720e">Canonical Structures vs Typeclasses</h2>
<ul>
<li>Both CS and TC can be used to implement overloading, implicit program (and proof) construction</li>
<li>Performance issues: experimental rewriting of MathComp with type classes did not scale up to modules on a ring</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgd6a1f94">
<h2 id="orgd6a1f94">Keying on terms: big operations</h2>
<p>
Mathcomp's <code>bigop</code> module defines monoids like so:
</p>
<div class="org-src-container">

<pre class="src src-coq"><span style="color: #3a81c3; font-weight: bold;">Module</span> <span style="color: #6c3163; font-weight: bold;">Monoid</span>.
...
<span style="color: #3a81c3; font-weight: bold;">Structure</span> <span style="color: #6c3163; font-weight: bold;">law</span> <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">T</span> : <span style="color: #ba2f59; font-weight: bold;">Type</span><span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">idm</span> : T<span style="color: #3a81c3;">)</span> : <span style="color: #ba2f59; font-weight: bold;">Type</span> :=
 Law
  <span style="color: #3a81c3;">{</span> <span style="color: #715ab1;">operator</span> : T -&gt; T -&gt; T;
    _ : associative operator;
    _ : left_id idm operator;
    _ : right_id idm operator <span style="color: #3a81c3;">}</span>.
...
<span style="color: #3a81c3; font-weight: bold;">End</span> <span style="color: #6c3163; font-weight: bold;">Monoid</span>.
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org3ff88b5">
<h2 id="org3ff88b5">Keying on terms: big operations</h2>
<ul>
<li>Monoids are usually not unique for a given type</li>

</ul>
<p>
Here are some instances on <code>nat</code>:
</p>
<div class="org-src-container">

<pre class="src src-coq">Canonical addn_monoid := Law addnA add0n addn0.
Canonical muln_monoid := Law mulnA mul1n muln1.
Canonical maxn_monoid := Law maxnA max0n maxn0.
</pre>
</div>
<ul>
<li>Haskell works around this using <code>newtype</code></li>
<li>Coq does not have to: it uses terms as keys</li>

</ul>
</section>
</section>
